InformationRegisters/НастройкиСервисаPodarIm.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>НастройкиСервисаPodarIm</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>URL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидСертификата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыСертификатов</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкиСервисаPodarIm/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаКлиенте
Процедура УстановитьДоступность()
	
	Редактирование = Запись.Использовать;
	
	// Элементы.
	Элементы.URL.Доступность = Редактирование;
	Элементы.ИмяПользователя.Доступность = Редактирование;
	Элементы.Пароль.Доступность = Редактирование;
	Элементы.ВидСертификата.Доступность = Редактирование;
	
КонецПроцедуры // УстановитьВидимость()


&НаКлиенте
Процедура ИспользоватьПриИзменении(Элемент)
	
	// Настройка формы.
	УстановитьДоступность();

КонецПроцедуры // ВебСервисИспользоватьПриИзменении()


&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)

	// Подавление проверки.
	Если Не Запись.Использовать Тогда
		ПроверяемыеРеквизиты.Очистить();	
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполненияНаСервере()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Подмена объекта формы.
	ЗаписьНастроек = РегистрыСведений.НастройкиСервисаPodarIm.СоздатьМенеджерЗаписи();	
	ЗаписьНастроек.Прочитать();
	Если ЗаписьНастроек.Выбран() Тогда
		ЗначениеВДанныеФормы(ЗаписьНастроек, Запись);
	КонецЕсли;
	
	// Заголовок.
	Заголовок = Метаданные.РегистрыСведений.НастройкиСервисаPodarIm.ПредставлениеЗаписи;

КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Модальный режим.
	Если Не МодальныйРежим Тогда
		ОткрытьФормуМодально("РегистрСведений.НастройкиСервисаPodarIm.ФормаЗаписи");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// Настройка формы.
	УстановитьДоступность();
	
КонецПроцедуры // ПриОткрытии()

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	// Признак приостановки сервера печати.
	ЗаписьНастроек = РегистрыСведений.НастройкиСервисаPodarIm.СоздатьМенеджерЗаписи();	

	// Удаление записи.
	Если Не Отказ Тогда
		ЗаписьНастроек.Удалить();
	КонецЕсли;

КонецПроцедуры // ПередЗаписьюНаСервере()
